## DATA SUMMARY

This is a data set of `Sprocket Central Pty Ltd` a medium size bikes & cycling accessories organisation.

`Sprocket Central Pty Ltd` needs help with its customer and transactions data. The organisation has a large dataset relating to its customers, but their team is unsure how to effectively analyse it to help optimise its marketing strategy.

The `Sprocket Central Pty Ltd` provided with 3 datasets:
- Customer Demographic 
- Customer Addresses
- Transactions data in the past 3 months

## Column descriptions

#### **Table** -> `Transactions`:

- `transaction_id`: Represents a unique identifier for each transaction. Each transaction, irrespective of the product or customer, has a distinct ID.
- `product_id`: Represents a unique identifier for each product sold by the company. Helps in distinguishing each product type or variant.
- `customer_id`: Represents a unique identifier for each customer making a purchase. This ID remains consistent across multiple transactions by the same customer.
- `transaction_date`: Date on which the transaction was executed. Gives insights into when a product was sold.
- `online_order`: Specifies if a transaction was made online or offline. Values are typically 'TRUE' for online and 'FALSE' for offline.
- `order_status`: Describes the current status of the order, such as "Approved" or "Cancelled".
- `brand`: Brand or manufacturer of the product involved in the transaction.
- `product_line`: Categorizes products into specific lines or types, indicating the broader category to which a product belongs.
- `product_class`: Classifies products based on certain characteristics or quality metrics. It can be High, medium, or low.
- `product_size`: Indicates the size variant of the product, such as small, medium, or large.
- `list_price`: The standard price at which the product is listed for sale to customers.
- `standard_cost`: Represents the cost incurred by the company to produce or acquire the product. Useful for margin calculations.
- `product_first_sold_date`: The date when the product was first sold or introduced in the market.

#### **Table** -> `CustomerDemographic`:

- `customer_id`: The unique identifier for each customer of Sprocket Central Pty Ltd, facilitating the identification of individual customers. This column contains alphanumeric data.
- `first_name`: First Name of each customer.
- `last_name`: Last Name of each customer.
- `gender`: Gender of each customer at birth (Male or Female).
- `past_3_years_bike_related_purchases`: The number of bike-related purchases made by each customer in the past 3 years.
- `DOB`: This column represents the "Date of Birth" for each customer.
- `job_title`: The job titles of each customer, indicating their respective professions or job roles.
- `job_industry_category`: The name of the industry in which each customer is employed, providing information about their work sector.
- `wealth_segment`: This column contains categorical data. It consists of labels or categories that classify customers into different wealth segments. The categories in this column represent the company way of grouping customers based on their financial circumstances, such as Mass Customer, Affluent Customer, and High Net Worth.
- `deceased_indicator`: This column uses binary categorical data. When it contains 'Y,' it means that the customer is deceased (no longer alive), and when it contains 'N,' it indicates that the customer is not deceased (still alive).
- `default`: Contains heterogeneous data types, including text, numbers, special characters, and non-standard formats.
- `owns_car`: Specifies whether a customer owns a car with values 'Yes' or 'No'. This column contains categorical data.
- `tenure`:  This column represents the length or duration of the customer's association with the company, typically expressed as a numerical value (e.g., the number of years).

#### **Table** -> `CustomerAddress`:

- `customer_id`: The unique identifier for each customer of Sprocket Central Pty Ltd, facilitating the identification of individual customers. This column contains alphanumeric data.
- `address`: The main address for each customer.
- `postcode`: The corresponding post code for the main address of each customer.
- `state`:The corresponding state for the main address of each customer.
- `country`: The corresponding country for the main address of each customer (all Australia for this Data).
- `property_valuation`: Represents the valuation of the property that the customer resides in or owns. The property valuation ranges from 1 to 12.

#### **Table** -> `NewCustomerList`:

- `first_name`: First Name of each customer.
- `last_name`: Last Name of each customer.
- `gender`: Gender of each customer at birth (Male or Female).
- `past_3_years_bike_related_purchases`: The number of bike-related purchases made by each customer in the past 3 years.
- `DOB`: This column represents the "Date of Birth" for each customer.
- `job_title`: The job titles of each customer, indicating their respective professions or job roles.
- `job_industry_category`: The name of the industry in which each customer is employed, providing information about their work sector.
- `wealth_segment`: This column contains categorical data. It consists of labels or categories that classify customers into different wealth segments. The categories in this column represent the company way of grouping customers based on their financial circumstances, such as Mass Customer, Affluent Customer, and High Net Worth.
- `deceased_indicator`: This column uses binary categorical data. When it contains 'Y', it means that the customer is deceased (no longer alive), and when it contains 'N' it indicates that the customer is not deceased (still alive).
- `owns_car`: Specifies whether a customer owns a car with values 'Yes' or 'No'. This column contains categorical data.
- `tenure`:  This column represents the length or duration of the customer's association with the company, typically expressed as a numerical value (e.g., the number of years).
- `address`: The main address for each customer.
- `postcode`: The corresponding post code for the main address of each customer.
- `state`:The corresponding state for the main address of each customer.
- `country`: The corresponding country for the main address of each customer (all Australia for this Data).
- `property_valuation`: Represents the valuation of the property that the customer resides in or owns. The property valuation ranges from 1 to 12.
- `Rank`: Rank of a customers based on a Value column.Ranks are assigned from 1 to 1000.
- `Value`: Represents a value score or metric for each customer. The exact context of this value is not provided. The value ranges from approximately 0.34 to 1.72.

# TASKS

### `1st Task`
Your task is to take a look at the following datasets provided by Sprocket Central Pty Ltd and identify all data quality issues. Once you've had a look at these datasets, draft an email to the client identifying all data quality issues.

### `2nd Task`
Create a PowerPoint presentation wihch outlines the approach we will be taking to identify which of the 1000 customers Sprocket Central Pty Ltd should target, based on this dataset. Explain the three phases:  Data Exploration; Model Development and Interpretation.

### `3rd Task`
Please develop a dashboard that we can present to the client at our next meeting. Display your data summary and results of the analysis in a dashboard (see tools/references for assistance). Specifically, your presentation should specify who Sprocket Central Pty Ltd' should be targeting out of the new 1000 customer list.

# 1st Task

Lets start the preliminary data exploration and identify ways to improve the quality of Sprocket Central Pty Ltd’s data.

### Issues with the dataset

1. Dirty Data

    Table - `Transactions`
      - online_order, order_status, brand, product_line, product_class, product_size columns need to be in category data type. `Validity`
      - product_first_sold_date is in "serial date" convert them into date dtype `Validity`
      - missing values in online_order(360), brand(197), product_line(197), product_class(197), product_size(197), standard_cost(197), product_first_sold_date(197) `Completeness`
      - customer_id 5034 is extra is not avilable in main Customer Demographic table `Accuracy`
      
    Table - `CustomerDemographic`
      - At customer_id= 1, 54, 57 wrong value is present as F, Femal and M respectively insted of Male and Female. `Consistency`
      - DOB data type needs to be in datetime64 `Validity`
      - n/a in job_industry_category col treated as nan `Validity`
      - gender , job_industry_category, wealth_segment, deceased_indicator, owns_car columns needs to be in category data type to save memory `Validity`
      - default contains heterogeneous data types need to drop `Validity`
      - tenure is in float need to be in int `Validity`
      - missing values in last_name(137), DOB(87), job_title(506), job_industry_category(656), default(302),tenure(87) `Completeness`
      - remove the rows where deceased_indicator is Y because its not useful for our target marketing anlaysis. `Validity`
      
    Table - `CustomerAddress` 
      - state col sometimes contain full name and some times abbrivietation i.e. NSW as New South Wales and VIC as Victoria `Consistency`
      - state columns needs to be in category data type to save memory `Validity`
      - postcode and property_valuation in float need to be in int `Validity`
      - customer_id 4001, 4002, 4003 is extra is not avilable in main Customer Demographic table `Accuracy`
      
    Table - `NewCustomerAddress` 
      - DOB data type needs to be in datetime64 `Validity`
      - Hidden Unamed: 16, Unamed: 17, Unamed: 18, Unamed: 19, Unamed: 20 columns are found. These are the formula base columns. Use to calculate Value and Rank columns. `Accuracy`
      - n/a in job_industry_category col treated as nan `Validity`
      - missing value in last_name(29), DOB(17), job_title(106), job_industry_category(165) `Completeness`
      - gender , job_industry_category, wealth_segment, deceased_indicator, owns_car, state columns needs to be in category data type to save memory `Validity`
      - Assign proper customer IDs to the NewCustomerAddress table to make it usable for future analysis `Completeness`

2. Messy Data

    Table - `CustomerAddress`
      - This table should not exist independently
      
    Table - `NewCustomerAddress`
      - This table  cannot be used for analysis because it lacks a connection or relationship with the Transactions table (which is the Fact table)

### Automatic Assessment

- head and tail
- sample
- info
- isnull
- duplicated
- describe

In [2]:
#Import the data into df
import pandas as pd

CustomerDemographic = pd.read_excel('KPMG_VI_New_raw_data_update_final.xlsx', sheet_name='CustomerDemographic', header = 1,dtype={'DOB': 'datetime64[ns]'})
CustomerAddress = pd.read_excel('KPMG_VI_New_raw_data_update_final.xlsx', sheet_name='CustomerAddress', header = 1)
NewCustomerList = pd.read_excel('KPMG_VI_New_raw_data_update_final.xlsx', sheet_name='NewCustomerList', header = 1,dtype={'DOB': 'datetime64[ns]'})
Transactions = pd.read_excel('KPMG_VI_New_raw_data_update_final.xlsx', sheet_name='Transactions', header = 1)

### Table -> `Transactions`

In [3]:
Transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 13 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   transaction_id           20000 non-null  int64
 1   product_id               20000 non-null  int64
 2   customer_id              20000 non-null  int64
 3   transaction_date         20000 non-null  datetime64[ns]
 4   online_order             19640 non-null  float64
 5   order_status             20000 non-null  object
 6   brand                    19803 non-null  object
 7   product_line             19803 non-null  object
 8   product_class            19803 non-null  object
 9   product_size             19803 non-null  object
 10  list_price               20000 non-null  float64
 11  standard_cost            19803 non-null  float64
 12  product_first_sold_date  19803 non-null  float64
dtypes: datetime64[ns](1), float64(4), int64(3), object(5)
memory usage: 2.0+ MB

In [4]:
#Check missing values
Transactions.isnull().sum()

transaction_id               0
product_id                   0
customer_id                  0
transaction_date             0
online_order               360
order_status                 0
brand                      197
product_line               197
product_class              197
product_size               197
list_price                   0
standard_cost              197
product_first_sold_date    197
dtype: int64

In [5]:
#Unique Transaction ID
Transactions['transaction_id'].duplicated().sum()

0

In [6]:
Transactions.describe()

,transaction_id,product_id,customer_id,online_order,list_price,standard_cost,product_first_sold_date
count,20000.000000,20000.00000,20000.000000,19640.000000,20000.000000,19803.000000,19803.000000
mean,10000.500000,45.36465,1738.246050,0.500458,1107.829449,556.046951,38199.776549
std,5773.647028,30.75359,1011.951046,0.500013,582.825242,405.955660,2875.201110
min,1.000000,0.00000,1.000000,0.000000,12.010000,7.210000,33259.000000
25%,5000.750000,18.00000,857.750000,0.000000,575.270000,215.140000,35667.000000
50%,10000.500000,44.00000,1736.000000,1.000000,1163.890000,507.580000,38216.000000
75%,15000.250000,72.00000,2613.000000,1.000000,1635.300000,795.100000,40672.000000
max,20000.000000,100.00000,5034.000000,1.000000,2091.470000,1759.850000,42710.000000

In [7]:
#Check the customer_id of CustomerAddress present in CustomerDemographic table
df = pd.merge(Transactions, CustomerDemographic, on = 'customer_id', how='left')

df.sort_values(by = 'gender', na_position='first').head()

,transaction_id,product_id,customer_id,transaction_date,online_order,order_status,brand,product_line,product_class,product_size,...,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,default,owns_car,tenure
8707,8708,0,5034,2017-10-07,0.0,Approved,Solex,Road,medium,medium,...,NaN,NaN,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN
16700,16701,0,5034,2017-01-27,0.0,Approved,Norco Bicycles,Standard,medium,medium,...,NaN,NaN,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN
17468,17469,0,5034,2017-01-03,0.0,Approved,OHM Cycles,Road,medium,medium,...,NaN,NaN,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN
16422,16423,9,1,2017-12-09,1.0,Approved,OHM Cycles,Road,medium,medium,...,F,93.0,1953-10-12,Executive Secretary,Health,Mass Customer,N,"""'",Yes,11.0
3764,3765,38,1,2017-04-06,1.0,Approved,Solex,Standard,medium,medium,...,F,93.0,1953-10-12,Executive Secretary,Health,Mass Customer,N,"""'",Yes,11.0

### Table -> `CustomerDemographic`

In [8]:
CustomerDemographic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4000 entries, 0 to 3999
Data columns (total 13 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   customer_id                          4000 non-null   int64
 1   first_name                           4000 non-null   object
 2   last_name                            3875 non-null   object
 3   gender                               4000 non-null   object
 4   past_3_years_bike_related_purchases  4000 non-null   int64
 5   DOB                                  3913 non-null   datetime64[ns]
 6   job_title                            3494 non-null   object
 7   job_industry_category                3344 non-null   object
 8   wealth_segment                       4000 non-null   object
 9   deceased_indicator                   4000 non-null   object
 10  default                              3698 non-null   object
 11  owns_car                             4000 non-null   object
 12  tenure                               3913 non-null   float64
dtypes: datetime64[ns](1), float64(1), int64(2), object(9)
memory usage: 406.4+ KB

In [9]:
#Check missing values
CustomerDemographic.isnull().sum()

customer_id                              0
first_name                               0
last_name                              125
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     87
job_title                              506
job_industry_category                  656
wealth_segment                           0
deceased_indicator                       0
default                                302
owns_car                                 0
tenure                                  87
dtype: int64

In [10]:
#Uniqe customer_id
CustomerDemographic['customer_id'].duplicated().sum()

0

In [11]:
#Consistency issue
CustomerDemographic['gender'].value_counts()

Female    2037
Male      1872
U           88
F            1
Femal        1
M            1
Name: gender, dtype: int64

In [12]:
CustomerDemographic[CustomerDemographic['gender'].isin(['M','F', 'Femal'])]

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,default,owns_car,tenure
0,1,Laraine,Medendorp,F,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,"""'",Yes,11.0
53,54,Loralyn,Wonfor,Femal,2,1966-07-24,Sales Associate,Property,Mass Customer,N,-0.5,Yes,18.0
56,57,Abba,Masedon,M,87,1988-06-13,Chief Design Engineer,NaN,Mass Customer,N,100,Yes,13.0

In [13]:
CustomerDemographic.describe()

       customer_id  past_3_years_bike_related_purchases       tenure
count  4000.000000                          4000.000000  3913.000000
mean   2000.500000                            48.890000    10.657041
std    1154.844867                            28.715005     5.660146
min       1.000000                             0.000000     1.000000
25%    1000.750000                            24.000000     6.000000
50%    2000.500000                            48.000000    11.000000
75%    3000.250000                            73.000000    15.000000
max    4000.000000                            99.000000    22.000000

### Table -> `CustomerAddress`

In [14]:
CustomerAddress.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3999 entries, 0 to 3998
Data columns (total 6 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   customer_id         3999 non-null   int64
 1   address             3999 non-null   object
 2   postcode            3999 non-null   int64
 3   state               3999 non-null   object
 4   country             3999 non-null   object
 5   property_valuation  3999 non-null   int64
dtypes: int64(3), object(3)
memory usage: 187.6+ KB

In [15]:
#Uniqe customer_id
CustomerAddress['customer_id'].duplicated().sum()

0

In [16]:
#Consistency issue
CustomerAddress['state'].value_counts()

NSW                2054
VIC                 939
QLD                 838
New South Wales      86
Victoria             82
Name: state, dtype: int64

In [17]:
CustomerAddress.describe()

       customer_id     postcode  property_valuation
count  3999.000000  3999.000000         3999.000000
mean   2003.987997  2985.755939            7.514379
std    1154.576912   844.878364            2.824663
min       1.000000  2000.000000            1.000000
25%    1004.500000  2200.000000            6.000000
50%    2004.000000  2768.000000            8.000000
75%    3003.500000  3750.000000           10.000000
max    4003.000000  4883.000000           12.000000

In [18]:
#Check the customer_id of CustomerAddress present in CustomerDemographic table
df = pd.merge(CustomerAddress, CustomerDemographic, on = 'customer_id', how='left')

df.sort_values(by = 'gender', na_position='first').head()

,customer_id,address,postcode,state,country,property_valuation,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,default,owns_car,tenure
3996,4001,87 Crescent Oaks Alley,2756,NSW,Australia,10,NaN,NaN,NaN,NaN,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3997,4002,8194 Lien Street,4032,QLD,Australia,7,NaN,NaN,NaN,NaN,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3998,4003,320 Acker Drive,2251,NSW,Australia,7,NaN,NaN,NaN,NaN,NaT,NaN,NaN,NaN,NaN,NaN,NaN,NaN
0,1,060 Morning Avenue,2016,New South Wales,Australia,10,Laraine,Medendorp,F,93.0,1953-10-12,Executive Secretary,Health,Mass Customer,N,"""'",Yes,11.0
49,54,6 Homewood Avenue,2142,New South Wales,Australia,8,Loralyn,Wonfor,Femal,2.0,1966-07-24,Sales Associate,Property,Mass Customer,N,-0.5,Yes,18.0

### Table -> `NewCustomerList`

In [19]:
NewCustomerList.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 23 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   first_name                           1000 non-null   object
 1   last_name                            971 non-null    object
 2   gender                               1000 non-null   object
 3   past_3_years_bike_related_purchases  1000 non-null   int64
 4   DOB                                  983 non-null    datetime64[ns]
 5   job_title                            894 non-null    object
 6   job_industry_category                835 non-null    object
 7   wealth_segment                       1000 non-null   object
 8   deceased_indicator                   1000 non-null   object
 9   owns_car                             1000 non-null   object
 10  tenure                               1000 non-null   int64
 11  address                              1000 non-null   object
 12  postcode                             1000 non-null   int64
 13  state                                1000 non-null   object
 14  country                              1000 non-null   object
 15  property_valuation                   1000 non-null   int64
 16  Unnamed: 16                          1000 non-null   float64
 17  Unnamed: 17                          1000 non-null   float64
 18  Unnamed: 18                          1000 non-null   float64
 19  Unnamed: 19                          1000 non-null   float64
 20  Unnamed: 20                          1000 non-null   int64
 21  Rank                                 1000 non-null   int64
 22  Value                                1000 non-null   float64
dtypes: datetime64[ns](1), float64(5), int64(6), object(11)
memory usage: 179.8+ KB

In [20]:
#Check missing values
NewCustomerList.isnull().sum()

first_name                               0
last_name                               29
gender                                   0
past_3_years_bike_related_purchases      0
DOB                                     17
job_title                              106
job_industry_category                  165
wealth_segment                           0
deceased_indicator                       0
owns_car                                 0
tenure                                   0
address                                  0
postcode                                 0
state                                    0
country                                  0
property_valuation                       0
Unnamed: 16                              0
Unnamed: 17                              0
Unnamed: 18                              0
Unnamed: 19                              0
Unnamed: 20                              0
Rank                                     0
Value                                    0
dtype: int64

In [21]:
#Uniqe customer combination of first_name and last_name
NewCustomerList.duplicated(subset=['first_name','last_name']).sum()

0

In [22]:
NewCustomerList.describe()

,past_3_years_bike_related_purchases,tenure,postcode,property_valuation,Unnamed: 16,Unnamed: 17,Unnamed: 18,Unnamed: 19,Unnamed: 20,Rank,Value
count,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000,1000.000000
mean,49.836000,11.388000,3019.227000,7.397000,0.747340,0.839005,0.942673,0.870514,498.819000,498.819000,0.881714
std,27.796686,5.037145,848.895767,2.758804,0.205082,0.248858,0.294832,0.280891,288.810997,288.810997,0.293525
min,0.000000,0.000000,2000.000000,1.000000,0.400000,0.400000,0.400000,0.340000,1.000000,1.000000,0.340000
25%,26.750000,7.000000,2209.000000,6.000000,0.570000,0.637500,0.712500,0.658750,250.000000,250.000000,0.649531
50%,51.000000,11.000000,2800.000000,8.000000,0.750000,0.820000,0.912500,0.842625,500.000000,500.000000,0.860000
75%,72.000000,15.000000,3845.500000,9.000000,0.920000,1.031875,1.142969,1.062500,750.250000,750.250000,1.075000
max,99.000000,22.000000,4879.000000,12.000000,1.100000,1.375000,1.718750,1.718750,1000.000000,1000.000000,1.718750

### I use this Data Quality Dimensions

- Completeness -> is data missing?
- Validity -> is data invalid -> negative height -> duplicate patient id
- Accuracy -> data is valid but not accurate -> weight -> 1kg
- Consistency -> both valid and accurate but written differently -> New Youk and NY

### Order of severity

Completeness <- Validity <- Accuracy <- Consistency

# Data Cleaning Order

1. Quality -> Completeness
2. Tidiness
3. Quality -> Validity
4. Quality -> Accuracy
5. Quality -> Consistency

#### Steps involved in Data cleaning
- Define
- Code
- Test

In [42]:
#Create a copy of your pandas dataframe before you start the cleaning process
CustomerDemographic_df = CustomerDemographic
CustomerAddress_df = CustomerAddress
Transactions_df = Transactions
NewCustomerList_df = NewCustomerList

### Define
- Perform a left merge between the CustomerDemographic_df and CustomerAddress_df DataFrames, and remove unnecessary columns. Synchronize both tables.
- replace a null value of str or object col with 'no data' and drop a null value of numerical or date col in CustomerDemographic_df which is (2.28%) of overall data
- change data-type into proper data-type to save memory and consistancy
- drop default column is not use in analysis.
- remove the consistency issue with the help of replace function
- remove the rows where deceased_indicator is Y because its not useful for our target marketing anlaysis.
- Only one 'U' is remain after above cleaning. So, I assume the value of U as "Male" because of his name "Jephthah Bachmann"

### Achive
- After data cleaning, I was able to save 30% of memory in CustomerDemographic_df (CustomerDemographic_df+CustomerAddress_df) table

In [43]:
#code
CustomerDemographic_df = pd.merge(CustomerDemographic_df, CustomerAddress_df, on ='customer_id', how = 'left')

In [44]:
#test
CustomerDemographic_df.head(3)

,customer_id,first_name,last_name,gender,past_3_years_bike_related_purchases,DOB,job_title,job_industry_category,wealth_segment,deceased_indicator,default,owns_car,tenure,address,postcode,state,country,property_valuation
0,1,Laraine,Medendorp,F,93,1953-10-12,Executive Secretary,Health,Mass Customer,N,"""'",Yes,11.0,060 Morning Avenue,2016.0,New South Wales,Australia,10.0
1,2,Eli,Bockman,Male,81,1980-12-16,Administrative Officer,Financial Services,Mass Customer,N,<script>alert('hi')</script>,Yes,16.0,6 Meadow Vale Court,2153.0,New South Wales,Australia,10.0
2,3,Arlin,Dearle,Male,61,1954-01-20,Recruiting Manager,Property,Mass Customer,N,2018-02-01 00:00:00,Yes,15.0,NaN,NaN,NaN,NaN,NaN

In [45]:
CustomerDemographic_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4000 entries, 0 to 3999
Data columns (total 18 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   customer_id                          4000 non-null   int64
 1   first_name                           4000 non-null   object
 2   last_name                            3875 non-null   object
 3   gender                               4000 non-null   object
 4   past_3_years_bike_related_purchases  4000 non-null   int64
 5   DOB                                  3913 non-null   datetime64[ns]
 6   job_title                            3494 non-null   object
 7   job_industry_category                3344 non-null   object
 8   wealth_segment                       4000 non-null   object
 9   deceased_indicator                   4000 non-null   object
 10  default                              3698 non-null   object
 11  owns_car                             4000 non-null   object
 12  tenure                               3913 non-null   float64
 13  address                              3996 non-null   object
 14  postcode                             3996 non-null   float64
 15  state                                3996 non-null   object
 16  country                              3996 non-null   object
 17  property_valuation                   3996 non-null   float64
dtypes: datetime64[ns](1), float64(3), int64(2), object(12)
memory usage: 593.8+ KB

In [46]:
#code

#replace a null value of str or object col
CustomerDemographic_df[['last_name', 'job_title', 'job_industry_category', 'default']] = CustomerDemographic_df[['last_name', 'job_title', 'job_industry_category', 'default']].fillna('no data')
#drop a null value of numerical or date col
CustomerDemographic_df=CustomerDemographic_df.dropna()

In [47]:
#test
CustomerDemographic_df.isnull().sum()

customer_id                            0
first_name                             0
last_name                              0
gender                                 0
past_3_years_bike_related_purchases    0
DOB                                    0
job_title                              0
job_industry_category                  0
wealth_segment                         0
deceased_indicator                     0
default                                0
owns_car                               0
tenure                                 0
address                                0
postcode                               0
state                                  0
country                                0
property_valuation                     0
dtype: int64

In [48]:
#code
dtype_C = {'gender': 'category', 'job_industry_category': 'category', 'wealth_segment': 'category',
         'owns_car': 'category', 'state': 'category',
            'tenure': int,'postcode': int,'property_valuation': int}

CustomerDemographic_df = CustomerDemographic_df.astype(dtype_C)

In [49]:
#test
CustomerDemographic_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3909 entries, 0 to 3999
Data columns (total 18 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   customer_id                          3909 non-null   int64
 1   first_name                           3909 non-null   object
 2   last_name                            3909 non-null   object
 3   gender                               3909 non-null   category
 4   past_3_years_bike_related_purchases  3909 non-null   int64
 5   DOB                                  3909 non-null   datetime64[ns]
 6   job_title                            3909 non-null   object
 7   job_industry_category                3909 non-null   category
 8   wealth_segment                       3909 non-null   category
 9   deceased_indicator                   3909 non-null   object
 10  default                              3909 non-null   object
 11  owns_car                             3909 non-null   category
 12  tenure                               3909 non-null   int64
 13  address                              3909 non-null   object
 14  postcode                             3909 non-null   int64
 15  state                                3909 non-null   category
 16  country                              3909 non-null   object
 17  property_valuation                   3909 non-null   int64
dtypes: category(5), datetime64[ns](1), int64(5), object(7)
memory usage: 447.7+ KB

In [50]:
#code
CustomerDemographic_df.drop(columns='default', inplace=True)

In [51]:
#test
CustomerDemographic_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3909 entries, 0 to 3999
Data columns (total 17 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   customer_id                          3909 non-null   int64
 1   first_name                           3909 non-null   object
 2   last_name                            3909 non-null   object
 3   gender                               3909 non-null   category
 4   past_3_years_bike_related_purchases  3909 non-null   int64
 5   DOB                                  3909 non-null   datetime64[ns]
 6   job_title                            3909 non-null   object
 7   job_industry_category                3909 non-null   category
 8   wealth_segment                       3909 non-null   category
 9   deceased_indicator                   3909 non-null   object
 10  owns_car                             3909 non-null   category
 11  tenure                               3909 non-null   int64
 12  address                              3909 non-null   object
 13  postcode                             3909 non-null   int64
 14  state                                3909 non-null   category
 15  country                              3909 non-null   object
 16  property_valuation                   3909 non-null   int64
dtypes: category(5), datetime64[ns](1), int64(5), object(6)
memory usage: 417.1+ KB

In [62]:
#code
index_di=CustomerDemographic_df[CustomerDemographic_df['deceased_indicator']=='Y'].index
CustomerDemographic_df=CustomerDemographic_df.drop(index_di)

In [63]:
#test
CustomerDemographic_df['deceased_indicator'].value_counts()

N    3907
Name: deceased_indicator, dtype: int64

In [66]:
CustomerDemographic_df['gender'].value_counts()

Female    2034
Male      1869
F            1
Femal        1
M            1
U            1
Name: gender, dtype: int64

In [67]:
#code 
CustomerDemographic_df['gender'].replace({'F':'Female', 'Femal': 'Female', 'M': 'Male', 'U': 'Male'}, inplace=True)

In [68]:
#test
CustomerDemographic_df['gender'].value_counts()

Female    2036
Male      1871
Name: gender, dtype: int64

In [69]:
#code 
CustomerDemographic_df['state'].replace({'Victoria':'VIC', 'New South Wales': 'NSW'}, inplace=True)

In [70]:
#test
CustomerDemographic_df['state'].value_counts()

NSW    2088
VIC     997
QLD     822
Name: state, dtype: int64

In [71]:
CustomerDemographic_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3907 entries, 0 to 3999
Data columns (total 17 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   customer_id                          3907 non-null   int64
 1   first_name                           3907 non-null   object
 2   last_name                            3907 non-null   object
 3   gender                               3907 non-null   category
 4   past_3_years_bike_related_purchases  3907 non-null   int64
 5   DOB                                  3907 non-null   datetime64[ns]
 6   job_title                            3907 non-null   object
 7   job_industry_category                3907 non-null   category
 8   wealth_segment                       3907 non-null   category
 9   deceased_indicator                   3907 non-null   object
 10  owns_car                             3907 non-null   category
 11  tenure                               3907 non-null   int64
 12  address                              3907 non-null   object
 13  postcode                             3907 non-null   int64
 14  state                                3907 non-null   category
 15  country                              3907 non-null   object
 16  property_valuation                   3907 non-null   int64
dtypes: category(5), datetime64[ns](1), int64(5), object(6)
memory usage: 416.8+ KB

### Define
- replace missing with 'no data' in order_status
- drop the remaining missing values which is (0.98%) of overall data
- Convert the categorical data into category datatype
- Convert the 'product_first_sold_date' column, which contains Excel serial numbers, to datetime
- Remove the customer_id 5034, which is not available in the CustomerDemographic_df

### Achive
- After data cleaning, I was able to save 35% of memory in Transactions_df table

In [72]:
Transactions_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20000 entries, 0 to 19999
Data columns (total 13 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   transaction_id           20000 non-null  int64
 1   product_id               20000 non-null  int64
 2   customer_id              20000 non-null  int64
 3   transaction_date         20000 non-null  datetime64[ns]
 4   online_order             20000 non-null  object
 5   order_status             20000 non-null  object
 6   brand                    19803 non-null  object
 7   product_line             19803 non-null  object
 8   product_class            19803 non-null  object
 9   product_size             19803 non-null  object
 10  list_price               20000 non-null  float64
 11  standard_cost            19803 non-null  float64
 12  product_first_sold_date  19803 non-null  float64
dtypes: datetime64[ns](1), float64(3), int64(3), object(6)
memory usage: 2.0+ MB

In [73]:
#code
Transactions_df['online_order'].fillna('no data', inplace=True)
Transactions_df = Transactions_df.dropna()

In [74]:
#test 
Transactions_df.isnull().sum()

transaction_id             0
product_id                 0
customer_id                0
transaction_date           0
online_order               0
order_status               0
brand                      0
product_line               0
product_class              0
product_size               0
list_price                 0
standard_cost              0
product_first_sold_date    0
dtype: int64

In [75]:
#code
dtype_t = {'online_order': 'category', 'order_status': 'category', 'brand': 'category', 'product_line': 'category'
           , 'product_class': 'category', 'product_size': 'category'}

Transactions_df = Transactions_df.astype(dtype_t)

In [76]:
#test
Transactions_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 19803 entries, 0 to 19999
Data columns (total 13 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   transaction_id           19803 non-null  int64
 1   product_id               19803 non-null  int64
 2   customer_id              19803 non-null  int64
 3   transaction_date         19803 non-null  datetime64[ns]
 4   online_order             19803 non-null  category
 5   order_status             19803 non-null  category
 6   brand                    19803 non-null  category
 7   product_line             19803 non-null  category
 8   product_class            19803 non-null  category
 9   product_size             19803 non-null  category
 10  list_price               19803 non-null  float64
 11  standard_cost            19803 non-null  float64
 12  product_first_sold_date  19803 non-null  float64
dtypes: category(6), datetime64[ns](1), float64(3), int64(3)
memory usage: 1.3 MB

In [77]:
#code
# Convert the Excel serial numbers to datetime
Transactions_df['product_first_sold_date'] = pd.to_datetime(Transactions_df['product_first_sold_date'], origin='1900-01-01', unit='D')

In [78]:
#test
Transactions_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 19803 entries, 0 to 19999
Data columns (total 13 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   transaction_id           19803 non-null  int64
 1   product_id               19803 non-null  int64
 2   customer_id              19803 non-null  int64
 3   transaction_date         19803 non-null  datetime64[ns]
 4   online_order             19803 non-null  category
 5   order_status             19803 non-null  category
 6   brand                    19803 non-null  category
 7   product_line             19803 non-null  category
 8   product_class            19803 non-null  category
 9   product_size             19803 non-null  category
 10  list_price               19803 non-null  float64
 11  standard_cost            19803 non-null  float64
 12  product_first_sold_date  19803 non-null  datetime64[ns]
dtypes: category(6), datetime64[ns](2), float64(2), int64(3)
memory usage: 1.3 MB

In [79]:
Transactions_df['product_first_sold_date'].head(3)

0   2012-12-04
1   2014-03-05
2   1999-07-22
Name: product_first_sold_date, dtype: datetime64[ns]

In [80]:
#code
Index_position = Transactions_df[Transactions_df['customer_id'] == 5034].index

Transactions_df = Transactions_df.drop(Index_position)

In [81]:
#test
(Transactions_df['customer_id'] == 5034).sum()

0

### Define
- replace missing value from object col, and remove it from DOB col which is (1.7%) of overall data
- change data-type into proper data-type to save memory and consistancy
- drop the Unamed column

### Achive
- After data cleaning, I was able to save 40.71% of memory in NewCustomerList_df table

In [82]:
NewCustomerList_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 23 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   first_name                           1000 non-null   object
 1   last_name                            971 non-null    object
 2   gender                               1000 non-null   object
 3   past_3_years_bike_related_purchases  1000 non-null   int64
 4   DOB                                  983 non-null    datetime64[ns]
 5   job_title                            894 non-null    object
 6   job_industry_category                835 non-null    object
 7   wealth_segment                       1000 non-null   object
 8   deceased_indicator                   1000 non-null   object
 9   owns_car                             1000 non-null   object
 10  tenure                               1000 non-null   int64
 11  address                              1000 non-null   object
 12  postcode                             1000 non-null   int64
 13  state                                1000 non-null   object
 14  country                              1000 non-null   object
 15  property_valuation                   1000 non-null   int64
 16  Unnamed: 16                          1000 non-null   float64
 17  Unnamed: 17                          1000 non-null   float64
 18  Unnamed: 18                          1000 non-null   float64
 19  Unnamed: 19                          1000 non-null   float64
 20  Unnamed: 20                          1000 non-null   int64
 21  Rank                                 1000 non-null   int64
 22  Value                                1000 non-null   float64
dtypes: datetime64[ns](1), float64(5), int64(6), object(11)
memory usage: 179.8+ KB

In [83]:
#code
NewCustomerList_df[['last_name','job_title','job_industry_category']]= NewCustomerList_df[['last_name','job_title','job_industry_category']].fillna('no data')
NewCustomerList_df = NewCustomerList_df.dropna()

In [84]:
#test
NewCustomerList_df.isnull().sum()

first_name                             0
last_name                              0
gender                                 0
past_3_years_bike_related_purchases    0
DOB                                    0
job_title                              0
job_industry_category                  0
wealth_segment                         0
deceased_indicator                     0
owns_car                               0
tenure                                 0
address                                0
postcode                               0
state                                  0
country                                0
property_valuation                     0
Unnamed: 16                            0
Unnamed: 17                            0
Unnamed: 18                            0
Unnamed: 19                            0
Unnamed: 20                            0
Rank                                   0
Value                                  0
dtype: int64

In [85]:
#code
dtype_NC = {'gender': 'category', 'job_industry_category': 'category', 'wealth_segment': 'category',
              'deceased_indicator': 'category', 'owns_car': 'category', 'state': 'category'}

NewCustomerList_df = NewCustomerList_df.astype(dtype_NC)

In [86]:
#test
NewCustomerList_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 983 entries, 0 to 999
Data columns (total 23 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   first_name                           983 non-null    object
 1   last_name                            983 non-null    object
 2   gender                               983 non-null    category
 3   past_3_years_bike_related_purchases  983 non-null    int64
 4   DOB                                  983 non-null    datetime64[ns]
 5   job_title                            983 non-null    object
 6   job_industry_category                983 non-null    category
 7   wealth_segment                       983 non-null    category
 8   deceased_indicator                   983 non-null    category
 9   owns_car                             983 non-null    category
 10  tenure                               983 non-null    int64
 11  address                              983 non-null    object
 12  postcode                             983 non-null    int64
 13  state                                983 non-null    category
 14  country                              983 non-null    object
 15  property_valuation                   983 non-null    int64
 16  Unnamed: 16                          983 non-null    float64
 17  Unnamed: 17                          983 non-null    float64
 18  Unnamed: 18                          983 non-null    float64
 19  Unnamed: 19                          983 non-null    float64
 20  Unnamed: 20                          983 non-null    int64
 21  Rank                                 983 non-null    int64
 22  Value                                983 non-null    float64
dtypes: category(6), datetime64[ns](1), float64(5), int64(6), object(5)
memory usage: 145.0+ KB

In [87]:
#code
NewCustomerList_df=NewCustomerList_df.drop(columns=['Unnamed: 16','Unnamed: 17','Unnamed: 18','Unnamed: 19','Unnamed: 20'])

In [88]:
#test
NewCustomerList_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 983 entries, 0 to 999
Data columns (total 18 columns):
 #   Column                               Non-Null Count  Dtype
---  ------                               --------------  -----
 0   first_name                           983 non-null    object
 1   last_name                            983 non-null    object
 2   gender                               983 non-null    category
 3   past_3_years_bike_related_purchases  983 non-null    int64
 4   DOB                                  983 non-null    datetime64[ns]
 5   job_title                            983 non-null    object
 6   job_industry_category                983 non-null    category
 7   wealth_segment                       983 non-null    category
 8   deceased_indicator                   983 non-null    category
 9   owns_car                             983 non-null    category
 10  tenure                               983 non-null    int64
 11  address                              983 non-null    object
 12  postcode                             983 non-null    int64
 13  state                                983 non-null    category
 14  country                              983 non-null    object
 15  property_valuation                   983 non-null    int64
 16  Rank                                 983 non-null    int64
 17  Value                                983 non-null    float64
dtypes: category(6), datetime64[ns](1), float64(1), int64(5), object(5)
memory usage: 106.6+ KB

# Export the Data to Excel
### Now Data is clean time to export it so use it for EDA

In [89]:
with pd.ExcelWriter("KMPG_transform_data.xlsx") as writer:
    CustomerDemographic_df.to_excel(writer, sheet_name="CustomerDemographic_df", index= False)  
    Transactions_df.to_excel(writer, sheet_name="Transactions_df", index= False)
    NewCustomerList_df.to_excel(writer, sheet_name="NewCustomerList_df", index= False)